// Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.

// Console.Write("Введите числа через пробел - ");

// string[] array = Console.ReadLine().Split(new Char[] { ' ' });

// int count = 0;

// for (int i=0; i < array.Length; i++)
// {
//         if ( Convert.ToInt32(array[i]) > 0) count += 1;
// }

// Console.WriteLine ("Количество введенных чисел больше 0 равно " + count);